<template>
	<div class="con-box">
		<!-- 保证金协议管理 -->
		<h3>保证金协议信息</h3>

		<div>
			<el-input
		  type="textarea"
		  :rows="15"
		  placeholder="请输入内容"
		  v-model="textarea" v-on:change="contentChange">
		</el-input>
		</div>
		<el-button>取消</el-button>
		<el-button type="success">修改</el-button>
	</div>
</template>
<script>
	export default {
	  data() {
	    return {
	      textarea:
	      "一、 协议内容及签署  1.本协议内容包括协议正文及所有淘宝已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何淘宝及其关联公司提供的服务（以下称为淘宝平台服务）均受本协议约束。  2.您应当在使用淘宝平台服务之前认真阅读全部协议内容，对于协议中以加粗字体显示的内容，您应重点阅读。如您对协议有任何疑问的，应向淘宝咨询。但无论您事实上是否在使用淘宝平台服务之前认真阅读了本协议内容，只要您使用淘宝平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得淘宝对您问询的解答等理由，主张本协议无效，或要求撤销本协议。  3.您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用淘宝平台服务。  4.淘宝有权根据需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在网站公布后，立即自动生效。如您不同意相关变更，应当立即停止使用淘宝平台服务。您继续使用淘宝平台服务的，即表示您接受经修订的协议和规则。\n二、 注册  1.注册者资格 您确认，在您完成注册程序或以其他淘宝允许的方式实际使用淘宝平台服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且淘宝有权注销（永久冻结）您的淘宝账户，并向您及您的监护人索偿。 2.账户  在您签署本协议，完成会员注册程序或以其他淘宝允许的方式实际使用淘宝平台服务时，淘宝会向您提供唯一编号的淘宝账户（以下亦称账户）。 您可以对账户设置会员名和密码，通过该会员名密码或与该会员名密码关联的其它用户名密码登陆淘宝平台。您设置的会员名不得侵犯或涉嫌侵犯他人合法权益。如您连续一年未使用您的会员名和密码登录淘宝平台，淘宝有权终止向您提供淘宝平台服务，注销您的账户。账户注销后，相应的会员名将开放给任意用户注册登记使用。 您应对您的账户（会员名）和密码的安全，以及对通过您的账户（会员名）和密码实施的行为负责。除非有法律规定或司法裁定，且征得淘宝的同意，否则，账户（会员名）和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。如果发现任何人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式通知淘宝，要求淘宝暂停相关服务。您理解淘宝对您的请求采取行动需要合理时间，淘宝对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。  为方便您使用淘宝平台服务及淘宝关联公司或其他组织的服务（以下称其他服务），您同意并授权淘宝将您在注册、使用淘宝平台服务过程中提供、形成的信息传递给向您提供其他服务的淘宝关联公司或其他组织，或从提供其他服务的淘宝关联公司或其他组织获取您在注册、使用其他服务期间提供、形成的信息。\n3.会员  在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他淘宝允许的方式实际使用淘宝平台服务时，您即成为淘宝平台会员（亦称会员）。  在注册时，您应当按照法律法规要求，或注册页面的提示准确提供，并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，淘宝有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部淘宝平台服务。淘宝对此不承担任何责任，您将承担因此产生的任何直接或间接支出。  您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便淘宝或其他会员与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用淘宝平台服务过程中产生任何损失或增加费用的，应由您完全独自承担。 您在使用淘宝平台服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担\n三、 淘宝平台服务  1.通过淘宝及其关联公司提供的淘宝平台服务和其它服务，会员可在淘宝平台上发布交易信息、查询商品和服务信息、达成交易意向并进行交易、对其他会员进行评价、参加淘宝组织的活动以及使用其它信息服务及技术服务。  2.您在淘宝平台上交易过程中与其他会员发生交易纠纷时，一旦您或其它会员任一方或双方共同提交淘宝要求调处，则淘宝有权根据单方判断做出调处决定，您了解并同意接受淘宝的判断和调处决定。该决定将对您具有法律约束力。  3.您了解并同意，淘宝有权应政府部门的要求，向其提供您在淘宝平台填写的注册信息和交易纪录等必要信息。如您涉嫌侵犯他人知识产权，则淘宝亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息"
	    }
	  },
	  methods:{
	  	contentChange(){
	  		console.log(this.textarea);
	  	}
	  }
	}
</script>
<style scoped>

</style>
